---
title: PartMakerMethodForMergePartFailures
classe: Autodesk.Revit.DB.BuiltInFailures+PartMakerMethodForMergePartFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# PartMakerMethodForMergePartFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId MergedPartHasDisConnectedGeometries { get; }` | `PartMakerMethodForMergePartFailures.MergedPartHasDisConnectedGeometries` | FailureDefinitionId |
| `FailureDefinitionId NeedTwoPartsToMerge { get; }` | `PartMakerMethodForMergePartFailures.NeedTwoPartsToMerge` | FailureDefinitionId |
| `FailureDefinitionId PartNotIncludedInMerge { get; }` | `PartMakerMethodForMergePartFailures.PartNotIncludedInMerge` | FailureDefinitionId |
| `FailureDefinitionId PartsCannotBeMerged { get; }` | `PartMakerMethodForMergePartFailures.PartsCannotBeMerged` | FailureDefinitionId |
| `FailureDefinitionId UnableToIncludePartInMerge { get; }` | `PartMakerMethodForMergePartFailures.UnableToIncludePartInMerge` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```